spark1e/stm32_CAN_latency/CAN_latency/drivers/Src/stm32f4xx_can_driver.c
/*
 * stm32f4xx_can_driver.c
 *
 *  Created on: Mar 14, 2026
 *      Author: Nikita Volkov (https://github.com/spark1e)
 *
 *  Bare-metal CAN driver for STM32F446RE.
 *  No HAL — direct register access only.
 *
 *  Supports:
 *    - CAN1 and CAN2
 *    - Polling (blocking) TX and RX
 *    - Interrupt-driven (non-blocking) TX and RX
 *    - Hardware filter bank configuration
 *    - Error / SCE interrupt handling
 */

#include "stm32f4xx_can_driver.h"

/*
 * Private helper function prototypes
 * These are not exposed in the header — they are internal to this driver only.
 */
static uint8_t can_get_free_tx_mailbox(CAN_RegDef_t *pCANx);
static void    can_tx_mailbox_IThandle(CAN_Handle_t *pCANHandle);
static void    can_rx_fifo_IThandle(CAN_Handle_t *pCANHandle, uint8_t FIFONumber);


/*
 * ============================================================
 * PERIPHERAL CLOCK CONTROL
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_PeriClockControl
 *
 * @brief		- Enables or disables the peripheral clock for the given CAN port
 *
 * @param[in]	- pCANx: base address of the CAN peripheral (CAN1 or CAN2)
 * @param[in]	- ENorDI: ENABLE or DISABLE macro
 *
 * @return		- none
 *
 * @Note		- CAN2 requires the CAN1 clock to be running because all 28 filter
 *                banks are owned by CAN1. Enabling CAN2 here automatically enables
 *                CAN1 as well. Do NOT disable CAN1 while CAN2 is still active.
 *
 * */
void CAN_PeriClockControl(CAN_RegDef_t *pCANx, uint8_t ENorDI){
	if(ENorDI == ENABLE){
		if(pCANx == CAN1){
			CAN1_PCLK_EN();
		}
		else if(pCANx == CAN2){
			CAN1_PCLK_EN();	// CAN1 clock needed for shared filter bank access
			CAN2_PCLK_EN();
		}
	}
	else{
		if(pCANx == CAN1)		CAN1_PCLK_DI();
		else if(pCANx == CAN2)	CAN2_PCLK_DI();
	}
}


/*
 * ============================================================
 * INIT / DE-INIT
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_Init
 *
 * @brief		- Initialises the CAN peripheral with the settings stored in the handle
 *
 * @param[in]	- pCANHandle: pointer to a fully populated CAN_Handle_t
 *
 * @return		- none
 *
 * @Note		- The function drives the peripheral through:
 *                  1. Enable peripheral clock
 *                  2. Request Initialization mode (INRQ) — MCR/MSR handshake
 *                  3. Configure MCR control bits (TTCM, ABOM, AWUM, NART, RFLM, TXFP)
 *                  4. Configure BTR (prescaler, TS1, TS2, SJW, operating mode)
 *                  5. Leave Initialization mode — peripheral enters Normal/Test mode
 *
 *              Call CAN_ConfigFilter() after CAN_Init() to accept specific message IDs.
 *              Until at least one filter is active the RX FIFOs will not receive frames.
 *
 * */
void CAN_Init(CAN_Handle_t *pCANHandle){
	uint32_t tempreg = 0;

	//1. Enable peripheral clock
	CAN_PeriClockControl(pCANHandle->pCANx, ENABLE);

	//2. Exit Sleep mode (SLEEP bit) and request Initialization mode (INRQ bit)
	pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_SLEEP);	// Exit sleep
	pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_INRQ);	// Request init mode

	//   Wait for hardware to acknowledge Initialization mode via INAK bit in MSR
	while(!(pCANHandle->pCANx->MSR & (1 << CAN_MSR_INAK)));

	//3. Configure MCR feature bits (must be done while in Initialization mode)

	//   TTCM — Time Triggered Communication Mode
	if(pCANHandle->CAN_Config.CAN_TTCM == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_TTCM);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_TTCM);

	//   ABOM — Automatic Bus-Off Management
	//   When enabled the peripheral recovers from bus-off automatically after 128 * 11 recessive bits
	if(pCANHandle->CAN_Config.CAN_ABOM == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_ABOM);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_ABOM);

	//   AWUM — Automatic Wakeup Mode
	if(pCANHandle->CAN_Config.CAN_AWUM == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_AWUM);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_AWUM);

	//   NART — No Automatic Retransmission
	//   Set ENABLE to transmit each frame only once regardless of errors (useful for real-time systems)
	if(pCANHandle->CAN_Config.CAN_NART == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_NART);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_NART);

	//   RFLM — Receive FIFO Locked Mode
	//   ENABLE: once full the FIFO is locked and new messages are discarded
	//   DISABLE: oldest message is overwritten by the newest (default behaviour)
	if(pCANHandle->CAN_Config.CAN_RFLM == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_RFLM);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_RFLM);

	//   TXFP — Transmit FIFO Priority
	//   ENABLE: transmission priority determined by chronological order of requests
	//   DISABLE: priority determined by message identifier (lower ID = higher priority)
	if(pCANHandle->CAN_Config.CAN_TXFP == ENABLE)
		pCANHandle->pCANx->MCR |=  (1 << CAN_MCR_TXFP);
	else
		pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_TXFP);

	//4. Configure BTR — Bit Timing Register
	//   This register can only be written while the peripheral is in Initialization mode
	tempreg = 0;

	//   BRP[9:0]: Baud Rate Prescaler. Actual clock divisor = BRP + 1.
	//   Store (CAN_Prescaler - 1) in the register field.
	tempreg |= (uint32_t)(pCANHandle->CAN_Config.CAN_Prescaler - 1) << CAN_BTR_BRP;

	//   TS1[19:16]: Time Segment 1. The macro values already match register encoding (actual = value + 1).
	tempreg |= (uint32_t)pCANHandle->CAN_Config.CAN_TimeSeg1 << CAN_BTR_TS1;

	//   TS2[22:20]: Time Segment 2.
	tempreg |= (uint32_t)pCANHandle->CAN_Config.CAN_TimeSeg2 << CAN_BTR_TS2;

	//   SJW[25:24]: Synchronisation Jump Width.
	tempreg |= (uint32_t)pCANHandle->CAN_Config.CAN_SyncJumpWidth << CAN_BTR_SJW;

	//   LBKM / SILM: test-mode bits (set based on CAN_Mode selection)
	if(pCANHandle->CAN_Config.CAN_Mode == CAN_MODE_LOOPBACK){
		tempreg |= (1 << CAN_BTR_LBKM);					// Enable internal loopback
	}
	else if(pCANHandle->CAN_Config.CAN_Mode == CAN_MODE_SILENT){
		tempreg |= (1 << CAN_BTR_SILM);					// Enable silent monitoring
	}
	else if(pCANHandle->CAN_Config.CAN_Mode == CAN_MODE_SILENT_LOOPBACK){
		tempreg |= (1 << CAN_BTR_LBKM) | (1 << CAN_BTR_SILM);	// Both bits set
	}
	// CAN_MODE_NORMAL: neither bit set — already zero in tempreg

	pCANHandle->pCANx->BTR = tempreg;

