spark1e/stm32_CAN_latency/CAN_latency/drivers/Src/stm32f4xx_can_driver.c
	//5. Leave Initialization mode — peripheral transitions to Normal (or test) mode
	pCANHandle->pCANx->MCR &= ~(1 << CAN_MCR_INRQ);

	//   Wait for hardware to confirm it has left Initialization mode (INAK cleared)
	while(pCANHandle->pCANx->MSR & (1 << CAN_MSR_INAK));

	//6. Initialise driver state variables
	pCANHandle->TxState = CAN_READY;
	pCANHandle->RxState = CAN_READY;
	pCANHandle->pRxMsg  = NULL;
}


/***********************************************************************************
 * @fn			- CAN_DeInit
 *
 * @brief		- Resets the CAN peripheral registers to their power-on defaults
 *
 * @param[in]	- pCANx: base address of the CAN peripheral (CAN1 or CAN2)
 *
 * @return		- none
 *
 * @Note		- none
 *
 * */
void CAN_DeInit(CAN_RegDef_t *pCANx){
	if(pCANx == CAN1)		CAN1_REG_RESET();
	else if(pCANx == CAN2)	CAN2_REG_RESET();
}


/*
 * ============================================================
 * FILTER CONFIGURATION
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_ConfigFilter
 *
 * @brief		- Configures one filter bank to accept (or reject) specific CAN IDs
 *
 * @param[in]	- pCANHandle: pointer to CAN handle (used only for reference; all
 *                filter registers are always accessed through CAN1)
 * @param[in]	- pFilterConfig: pointer to the populated filter configuration struct
 *
 * @return		- none
 *
 * @Note		- All 28 filter banks are owned by CAN1 even when filtering for CAN2.
 *                The number of banks assigned to CAN1 vs CAN2 is controlled by
 *                CAN_FMR[CAN2SB]. Default split: banks 0-13 → CAN1, 14-27 → CAN2.
 *
 *              Mask mode (CAN_FILTERMODE_IDMASK):
 *                FR1 = ID bits to match, FR2 = care mask (1=must match, 0=don't care)
 *
 *              List mode (CAN_FILTERMODE_IDLIST):
 *                FR1 = first accepted ID, FR2 = second accepted ID
 *
 *              For 32-bit scale: IDs must be shifted left by 3 (STID at [31:21] or
 *              EXID at [31:3]) with IDE and RTR bits included if needed.
 *
 * */
void CAN_ConfigFilter(CAN_Handle_t *pCANHandle, CAN_FilterConfig_t *pFilterConfig){
	(void)pCANHandle;	// Filter banks always accessed through CAN1 regardless of handle

	uint32_t filternbrbitpos = (1U << pFilterConfig->FilterBank);

	//1. Enter filter Initialisation mode — FINIT bit in FMR
	//   While FINIT = 1 the active filters are frozen; they can be modified safely
	CAN1->FMR |= (1 << CAN_FMR_FINIT);

	//2. Deactivate the target filter bank before modifying its registers
	CAN1->FA1R &= ~filternbrbitpos;

	//3. Set filter scale: 16-bit pair or single 32-bit
	if(pFilterConfig->FilterScale == CAN_FILTERSCALE_16BIT){
		CAN1->FS1R &= ~filternbrbitpos;	// 0 = 16-bit scale

		//   Two 16-bit filters are packed into the two 32-bit filter registers:
		//     FR1[15:0]  = FilterIdLow      FR1[31:16] = FilterMaskIdLow
		//     FR2[15:0]  = FilterIdHigh     FR2[31:16] = FilterMaskIdHigh
		CAN1->sFilterRegister[pFilterConfig->FilterBank].FR1 =
			((pFilterConfig->FilterMaskIdLow  & 0xFFFFU) << 16) |
			 (pFilterConfig->FilterIdLow      & 0xFFFFU);

		CAN1->sFilterRegister[pFilterConfig->FilterBank].FR2 =
			((pFilterConfig->FilterMaskIdHigh & 0xFFFFU) << 16) |
			 (pFilterConfig->FilterIdHigh     & 0xFFFFU);
	}
	else{
		CAN1->FS1R |= filternbrbitpos;	// 1 = 32-bit scale

		//   One 32-bit filter:
		//     FR1 = full 32-bit ID   (mask mode: ID to match;   list mode: first accepted ID)
		//     FR2 = full 32-bit mask (mask mode: care mask;     list mode: second accepted ID)
		CAN1->sFilterRegister[pFilterConfig->FilterBank].FR1 =
			((pFilterConfig->FilterIdHigh & 0xFFFFU) << 16) |
			 (pFilterConfig->FilterIdLow  & 0xFFFFU);

		CAN1->sFilterRegister[pFilterConfig->FilterBank].FR2 =
			((pFilterConfig->FilterMaskIdHigh & 0xFFFFU) << 16) |
			 (pFilterConfig->FilterMaskIdLow  & 0xFFFFU);
	}

	//4. Set filter mode: identifier mask or identifier list
	if(pFilterConfig->FilterMode == CAN_FILTERMODE_IDMASK)
		CAN1->FM1R &= ~filternbrbitpos;	// 0 = mask mode
	else
		CAN1->FM1R |=  filternbrbitpos;	// 1 = list mode

	//5. Assign filter bank output to FIFO 0 or FIFO 1
	if(pFilterConfig->FilterFIFOAssignment == CAN_FIFO0)
		CAN1->FFA1R &= ~filternbrbitpos;	// 0 = FIFO 0
	else
		CAN1->FFA1R |=  filternbrbitpos;	// 1 = FIFO 1

	//6. Activate or deactivate this filter bank
	if(pFilterConfig->FilterActivation == ENABLE)
		CAN1->FA1R |=  filternbrbitpos;
	else
		CAN1->FA1R &= ~filternbrbitpos;

	//7. Leave filter Initialisation mode — configured filters go active immediately
	CAN1->FMR &= ~(1 << CAN_FMR_FINIT);
}


/*
 * ============================================================
 * POLLING (BLOCKING) SEND AND RECEIVE
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_SendMessage (blocking)
 *
 * @brief		- Loads a message into a free TX mailbox and blocks until transmission
 *                is confirmed by the CAN hardware (TXOK flag in TSR)
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 * @param[in]	- pTxMsg: pointer to the message to transmit
 *
 * @return		- CAN_TX_MAILBOX0/1/2 — the mailbox that was used
 *                CAN_TX_MAILBOX_NONE  — returned immediately if all mailboxes are busy
 *
 * @Note		- For Phase 2 latency measurement:
 *                  Record T0 (TIM2 count) immediately before calling this function.
 *                  The CAN frame hits the bus within ~2 µs of TXRQ being set.
 *
 * */
uint8_t CAN_SendMessage(CAN_Handle_t *pCANHandle, CAN_TxMsg_t *pTxMsg){
	uint32_t tempreg = 0;
	uint8_t  mailbox = can_get_free_tx_mailbox(pCANHandle->pCANx);

	if(mailbox == CAN_TX_MAILBOX_NONE){
		return CAN_TX_MAILBOX_NONE;	// All three mailboxes are occupied
	}

	//1. Build the TX identifier register value (do NOT set TXRQ yet)
	tempreg = 0;
	if(pTxMsg->IDE == CAN_ID_STD){
		//   Standard 11-bit ID: STID[10:0] sits at bits [31:21] of TIR
		tempreg |= (pTxMsg->StdId << CAN_TIR_STID);
	}
	else{
		//   Extended 29-bit ID: full ID spans STID[31:21] + EXID[20:3]
		tempreg |= (pTxMsg->ExtId << CAN_TIR_EXID);
		tempreg |= (1 << CAN_TIR_IDE);	// Set IDE bit to mark as extended frame
	}
	if(pTxMsg->RTR == CAN_RTR_REMOTE)
		tempreg |= (1 << CAN_TIR_RTR);	// Set RTR bit for remote frame

	pCANHandle->pCANx->sTxMailBox[mailbox].TIR = tempreg;

