spark1e/stm32_CAN_latency/CAN_latency/drivers/Src/stm32f4xx_can_driver.c
	//2. Write DLC (data length code) into TDTR[3:0]
	pCANHandle->pCANx->sTxMailBox[mailbox].TDTR = (pTxMsg->DLC & 0xFU);

	//3. Load data bytes into TDLR (bytes 0-3) and TDHR (bytes 4-7)
	pCANHandle->pCANx->sTxMailBox[mailbox].TDLR =
		((uint32_t)pTxMsg->Data[3] << 24) |
		((uint32_t)pTxMsg->Data[2] << 16) |
		((uint32_t)pTxMsg->Data[1] <<  8) |
		((uint32_t)pTxMsg->Data[0]);

	pCANHandle->pCANx->sTxMailBox[mailbox].TDHR =
		((uint32_t)pTxMsg->Data[7] << 24) |
		((uint32_t)pTxMsg->Data[6] << 16) |
		((uint32_t)pTxMsg->Data[5] <<  8) |
		((uint32_t)pTxMsg->Data[4]);

	//4. Set TXRQ bit in TIR to request transmission — frame enters the CAN bus scheduler
	pCANHandle->pCANx->sTxMailBox[mailbox].TIR |= (1 << CAN_TIR_TXRQ);

	//5. Wait (block) until the mailbox transaction completes — successful or not.
	//   RQCP (Request Completed) is set when the mailbox is done, regardless of outcome.
	//   After RQCP, check TXOK to know whether the frame was actually ACKed by another node.
	//   Without this, a missing ACK in NART=DISABLE mode would hang forever (TXOK never sets
	//   while the controller keeps retransmitting); in NART=ENABLE one-shot mode TXOK also
	//   never sets when the frame fails, so polling just on TXOK is unsafe in either mode.
	uint32_t rqcp_bit = (mailbox == 0) ? CAN_TSR_RQCP0 :
	                    (mailbox == 1) ? CAN_TSR_RQCP1 : CAN_TSR_RQCP2;
	uint32_t txok_bit = (mailbox == 0) ? CAN_TSR_TXOK0 :
	                    (mailbox == 1) ? CAN_TSR_TXOK1 : CAN_TSR_TXOK2;

	//   Coarse timeout — large enough that a successful frame at any reasonable bitrate
	//   will complete well before expiry, but small enough that the caller is not stuck
	//   forever if the bus is silent or misconfigured.
	uint32_t timeout = 0x00FFFFFFU;
	while(!(pCANHandle->pCANx->TSR & (1U << rqcp_bit))){
		if(--timeout == 0){
			return CAN_TX_MAILBOX_NONE;	// Bus stuck — caller decides what to do
		}
	}

	// Save TXOK BEFORE clearing RQCP — clearing RQCP also clears TXOK (RM0390 §32.9.4)
	uint8_t txok = (pCANHandle->pCANx->TSR & (1U << txok_bit)) ? 1 : 0;

	// Now clear RQCP
	pCANHandle->pCANx->TSR |= (1U << rqcp_bit);

	// Return result based on saved value
	if(txok){
	    return mailbox;
	}
	return CAN_TX_MAILBOX_NONE;
}


/***********************************************************************************
 * @fn			- CAN_ReceiveMessage (blocking)
 *
 * @brief		- Blocks until a message arrives in the specified FIFO, then reads
 *                it into pRxMsg and releases the FIFO slot back to hardware
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 * @param[in]	- FIFONumber: CAN_FIFO0 or CAN_FIFO1
 * @param[out]	- pRxMsg: pointer to the structure that will be filled with the
 *                received message
 *
 * @return		- none
 *
 * @Note		- For Phase 2 latency measurement:
 *                  Record T1 (TIM2 count) immediately after this function returns.
 *                  Latency = T1 - T0 (microseconds, given TIM2 runs at 1 MHz).
 *
 * */
void CAN_ReceiveMessage(CAN_Handle_t *pCANHandle, uint8_t FIFONumber, CAN_RxMsg_t *pRxMsg){
	//1. Wait until at least one message is pending in the selected FIFO
	//   FMP[1:0] in RF0R / RF1R = number of messages waiting (0-3)
	if(FIFONumber == CAN_FIFO0){
		while(!(pCANHandle->pCANx->RF0R & (0x3U << CAN_RF0R_FMP0)));
	}
	else{
		while(!(pCANHandle->pCANx->RF1R & (0x3U << CAN_RF1R_FMP1)));
	}

	//2. Read the identifier from RIR
	if(!(pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR & (1 << CAN_RIR_IDE))){
		//   Standard frame (IDE = 0): read 11-bit STID from bits [31:21]
		pRxMsg->IDE   = CAN_ID_STD;
		pRxMsg->StdId = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR >> CAN_RIR_STID) & 0x7FFU;
	}
	else{
		//   Extended frame (IDE = 1): read 29-bit ID from STID[31:21] + EXID[20:3]
		pRxMsg->IDE   = CAN_ID_EXT;
		pRxMsg->ExtId = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR >> CAN_RIR_EXID) & 0x1FFFFFFFU;
	}

	//   Read RTR bit
	pRxMsg->RTR = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR >> CAN_RIR_RTR) & 0x1U;

	//3. Read DLC and Filter Match Index from RDTR
	pRxMsg->DLC = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDTR)                  & 0xFU;
	pRxMsg->FMI = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDTR >> CAN_RDTR_FMI) & 0xFFU;

	//4. Read data bytes from RDLR (bytes 0-3) and RDHR (bytes 4-7)
	pRxMsg->Data[0] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR)        & 0xFFU;
	pRxMsg->Data[1] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >>  8)  & 0xFFU;
	pRxMsg->Data[2] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >> 16)  & 0xFFU;
	pRxMsg->Data[3] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >> 24)  & 0xFFU;
	pRxMsg->Data[4] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR)        & 0xFFU;
	pRxMsg->Data[5] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >>  8)  & 0xFFU;
	pRxMsg->Data[6] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >> 16)  & 0xFFU;
	pRxMsg->Data[7] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >> 24)  & 0xFFU;

	//5. Release the FIFO output mailbox so hardware can write the next received frame
	//   Setting RFOM (Release FIFO Output Mailbox) causes FMP to decrement by 1
	if(FIFONumber == CAN_FIFO0)
		pCANHandle->pCANx->RF0R |= (1 << CAN_RF0R_RFOM0);
	else
		pCANHandle->pCANx->RF1R |= (1 << CAN_RF1R_RFOM1);
}


/*
 * ============================================================
 * INTERRUPT MODE SEND AND RECEIVE
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_SendMessageIT (non-blocking)
 *
 * @brief		- Loads a message into a free TX mailbox, enables the TX mailbox
 *                empty interrupt (TMEIE), and returns immediately
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 * @param[in]	- pTxMsg: pointer to message to transmit
 *
 * @return		- Mailbox number used (CAN_TX_MAILBOX0/1/2)
 *                CAN_TX_MAILBOX_NONE if all mailboxes are occupied
 *
 * @Note		- CAN_ApplicationEventCallback() is called with event code
 *                CAN_EVENT_TX_MAILBOX_EMPTY when transmission is complete.
 *                For latency measurement record T0 before this call and T1
 *                at the start of the callback.
 *
 * */
uint8_t CAN_SendMessageIT(CAN_Handle_t *pCANHandle, CAN_TxMsg_t *pTxMsg){
	uint32_t tempreg = 0;
	uint8_t  mailbox = can_get_free_tx_mailbox(pCANHandle->pCANx);

	if(mailbox == CAN_TX_MAILBOX_NONE){
		return CAN_TX_MAILBOX_NONE;
	}

	//1. Build TIR — identical to the polling version (see CAN_SendMessage)
	tempreg = 0;
	if(pTxMsg->IDE == CAN_ID_STD){
		tempreg |= (pTxMsg->StdId << CAN_TIR_STID);
	}
	else{
		tempreg |= (pTxMsg->ExtId << CAN_TIR_EXID);
		tempreg |= (1 << CAN_TIR_IDE);
	}
	if(pTxMsg->RTR == CAN_RTR_REMOTE)
		tempreg |= (1 << CAN_TIR_RTR);

	pCANHandle->pCANx->sTxMailBox[mailbox].TIR  = tempreg;
	pCANHandle->pCANx->sTxMailBox[mailbox].TDTR = (pTxMsg->DLC & 0xFU);

	pCANHandle->pCANx->sTxMailBox[mailbox].TDLR =
		((uint32_t)pTxMsg->Data[3] << 24) | ((uint32_t)pTxMsg->Data[2] << 16) |
		((uint32_t)pTxMsg->Data[1] <<  8) | ((uint32_t)pTxMsg->Data[0]);

