spark1e/stm32_CAN_latency/CAN_latency/drivers/Src/stm32f4xx_can_driver.c
	pCANHandle->pCANx->sTxMailBox[mailbox].TDHR =
		((uint32_t)pTxMsg->Data[7] << 24) | ((uint32_t)pTxMsg->Data[6] << 16) |
		((uint32_t)pTxMsg->Data[5] <<  8) | ((uint32_t)pTxMsg->Data[4]);

	//2. Enable TX mailbox empty interrupt — ISR fires when mailbox becomes empty after TX
	pCANHandle->pCANx->IER |= (1 << CAN_IER_TMEIE);

	//3. Mark driver as busy
	pCANHandle->TxState = CAN_BUSY_IN_TX;

	//4. Set TXRQ — frame enters bus scheduler, transmission starts
	pCANHandle->pCANx->sTxMailBox[mailbox].TIR |= (1 << CAN_TIR_TXRQ);

	return mailbox;
}


/***********************************************************************************
 * @fn			- CAN_ReceiveMessageIT (non-blocking)
 *
 * @brief		- Arms the specified FIFO to generate an interrupt on message arrival.
 *                The ISR reads the message into pRxMsg and calls the callback.
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 * @param[in]	- FIFONumber: CAN_FIFO0 or CAN_FIFO1
 * @param[out]	- pRxMsg: pointer to RX message buffer filled by the ISR
 *
 * @return		- CAN_READY on success
 *                CAN_BUSY_IN_RX0 or CAN_BUSY_IN_RX1 if already armed for that FIFO
 *
 * @Note		- The FIFO interrupt is disarmed after each received message.
 *                Call CAN_ReceiveMessageIT() again inside the callback to re-arm
 *                for continuous reception.
 *
 * */
uint8_t CAN_ReceiveMessageIT(CAN_Handle_t *pCANHandle, uint8_t FIFONumber, CAN_RxMsg_t *pRxMsg){
	//Save the receive buffer pointer so the ISR can write directly into it
	pCANHandle->pRxMsg = pRxMsg;
	pCANHandle->RxFIFO = FIFONumber;

	if(FIFONumber == CAN_FIFO0){
		if(pCANHandle->RxState == CAN_BUSY_IN_RX0)
			return CAN_BUSY_IN_RX0;	// Already armed for FIFO 0

		pCANHandle->RxState = CAN_BUSY_IN_RX0;

		//Enable FIFO 0 message pending interrupt (fires as long as FMP0 > 0)
		pCANHandle->pCANx->IER |= (1 << CAN_IER_FMPIE0);

		//Enable FIFO 0 overrun interrupt so the application is notified of lost frames
		pCANHandle->pCANx->IER |= (1 << CAN_IER_FOVIE0);
	}
	else{
		if(pCANHandle->RxState == CAN_BUSY_IN_RX1)
			return CAN_BUSY_IN_RX1;	// Already armed for FIFO 1

		pCANHandle->RxState = CAN_BUSY_IN_RX1;

		//Enable FIFO 1 message pending interrupt
		pCANHandle->pCANx->IER |= (1 << CAN_IER_FMPIE1);

		//Enable FIFO 1 overrun interrupt
		pCANHandle->pCANx->IER |= (1 << CAN_IER_FOVIE1);
	}

	return CAN_READY;
}


/*
 * ============================================================
 * IRQ CONFIGURATION
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_IRQITConfig
 *
 * @brief		- Enables or disables a CAN interrupt line in the NVIC
 *
 * @param[in]	- IRQNumber: NVIC IRQ number (use IRQ_NO_CAN1_TX, IRQ_NO_CAN1_RX0, etc.)
 * @param[in]	- ENorDI: ENABLE or DISABLE
 *
 * @return		- none
 *
 * @Note		- none
 *
 * */
void CAN_IRQITConfig(uint8_t IRQNumber, uint8_t ENorDI){
	if(ENorDI == ENABLE){
		if(IRQNumber <= 31)
			*NVIC_ISER0 |= (1 << IRQNumber);
		else if(IRQNumber > 31 && IRQNumber < 64)
			*NVIC_ISER1 |= (1 << (IRQNumber % 32));
		else if(IRQNumber >= 64 && IRQNumber < 96)
			*NVIC_ISER2 |= (1 << (IRQNumber % 64));
	}
	else{
		if(IRQNumber <= 31)
			*NVIC_ICER0 |= (1 << IRQNumber);
		else if(IRQNumber > 31 && IRQNumber < 64)
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));
		else if(IRQNumber >= 64 && IRQNumber < 96)
			*NVIC_ICER2 |= (1 << (IRQNumber % 64));
	}
}


/***********************************************************************************
 * @fn			- CAN_IRQPriorityConfig
 *
 * @brief		- Sets the priority of a CAN interrupt in the NVIC
 *
 * @param[in]	- IRQNumber: NVIC IRQ number
 * @param[in]	- IRQPriority: priority value (0 = highest; STM32F446 implements 4 bits → 0-15)
 *
 * @return		- none
 *
 * @Note		- For the latency project: assign CAN_RX0 a higher priority than
 *                any other interrupt to minimise RX ISR latency jitter.
 *
 * */
void CAN_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority){
	uint8_t iprx         = IRQNumber / 4;
	uint8_t iprx_section = IRQNumber % 4;
	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASEADDR + iprx) |= (IRQPriority << shift_amount);
}


/*
 * ============================================================
 * ISR HANDLING — call these from your CAN IRQ handler stubs
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_TX_IRQHandling
 *
 * @brief		- TX interrupt handler — place a call to this inside
 *                CAN1_TX_IRQHandler() or CAN2_TX_IRQHandler() in your application
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 *
 * @return		- none
 *
 * @Note		- Calls the private can_tx_mailbox_IThandle() helper which:
 *                  1. Clears the RQCP (request completed) flags for each mailbox
 *                  2. Disables TMEIE once all mailboxes are empty
 *                  3. Fires CAN_ApplicationEventCallback(CAN_EVENT_TX_MAILBOX_EMPTY)
 *
 * */
void CAN_TX_IRQHandling(CAN_Handle_t *pCANHandle){
	can_tx_mailbox_IThandle(pCANHandle);
}


/***********************************************************************************
 * @fn			- CAN_RX0_IRQHandling
 *
 * @brief		- RX FIFO 0 interrupt handler — call from CAN1_RX0_IRQHandler()
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 *
 * @return		- none
 *
 * @Note		- Handles two FIFO 0 events:
 *                  FMPIE0 — message pending → read message, release slot, callback
 *                  FOVIE0 — overrun         → clear flag, callback with overrun event
 *
 * */
void CAN_RX0_IRQHandling(CAN_Handle_t *pCANHandle){
	uint8_t temp1, temp2;

	//Check: at least one message is pending in FIFO 0 and FMPIE0 is enabled
	temp1 = (pCANHandle->pCANx->RF0R & (0x3U << CAN_RF0R_FMP0)) ? 1 : 0;
	temp2 = (pCANHandle->pCANx->IER  & (1    << CAN_IER_FMPIE0)) ? 1 : 0;
	if(temp1 && temp2){
		can_rx_fifo_IThandle(pCANHandle, CAN_FIFO0);
	}

	//Check: FIFO 0 overrun and FOVIE0 enabled
	temp1 = (pCANHandle->pCANx->RF0R & (1 << CAN_RF0R_FOVR0)) ? 1 : 0;
	temp2 = (pCANHandle->pCANx->IER  & (1 << CAN_IER_FOVIE0)) ? 1 : 0;
	if(temp1 && temp2){
		pCANHandle->pCANx->RF0R |= (1 << CAN_RF0R_FOVR0);	// Clear overrun flag by writing 1
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_RX_FIFO0_OVERRUN);
	}
}


/***********************************************************************************
 * @fn			- CAN_RX1_IRQHandling
 *
 * @brief		- RX FIFO 1 interrupt handler — call from CAN1_RX1_IRQHandler()
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 *
 * @return		- none
 *
 * @Note		- Mirrors CAN_RX0_IRQHandling() for FIFO 1
 *
 * */
void CAN_RX1_IRQHandling(CAN_Handle_t *pCANHandle){
	uint8_t temp1, temp2;

	//Check: message pending in FIFO 1
	temp1 = (pCANHandle->pCANx->RF1R & (0x3U << CAN_RF1R_FMP1)) ? 1 : 0;
	temp2 = (pCANHandle->pCANx->IER  & (1    << CAN_IER_FMPIE1)) ? 1 : 0;
	if(temp1 && temp2){
		can_rx_fifo_IThandle(pCANHandle, CAN_FIFO1);
	}

	//Check: FIFO 1 overrun
	temp1 = (pCANHandle->pCANx->RF1R & (1 << CAN_RF1R_FOVR1)) ? 1 : 0;
	temp2 = (pCANHandle->pCANx->IER  & (1 << CAN_IER_FOVIE1)) ? 1 : 0;
	if(temp1 && temp2){
		pCANHandle->pCANx->RF1R |= (1 << CAN_RF1R_FOVR1);
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_RX_FIFO1_OVERRUN);
	}
}


/***********************************************************************************
 * @fn			- CAN_SCE_IRQHandling
 *
 * @brief		- Status Change / Error interrupt handler
 *                Call from CAN1_SCE_IRQHandler() or CAN2_SCE_IRQHandler()
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 *
 * @return		- none
 *
 * @Note		- When CAN_EVENT_ERROR fires the application should read ESR to
 *                diagnose the fault:
 *                  ESR[BOFF]   — Bus-off: TX error counter exceeded 255
 *                  ESR[EPVF]   — Error passive: error counter >= 128
 *                  ESR[EWGF]   — Error warning: error counter >= 96
 *                  ESR[LEC]    — Last error code (bit-error, stuff-error, etc.)
 *                  ESR[TEC/REC]— Transmit / Receive error counters
 *
 * */
void CAN_SCE_IRQHandling(CAN_Handle_t *pCANHandle){
	//Check ERRI flag in MSR — set by hardware when an error condition occurs
	if(pCANHandle->pCANx->MSR & (1 << CAN_MSR_ERRI)){
		//Clear ERRI by writing 1 (rc_w1 — read/clear with write-1)
		pCANHandle->pCANx->MSR |= (1 << CAN_MSR_ERRI);
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_ERROR);
	}
}


