spark1e/stm32_CAN_latency/CAN_latency/drivers/Src/stm32f4xx_can_driver.c
/*
 * ============================================================
 * APPLICATION CALLBACK
 * ============================================================
 */

/***********************************************************************************
 * @fn			- CAN_ApplicationEventCallback
 *
 * @brief		- Weak default callback — override in your application source file
 *
 * @param[in]	- pCANHandle: pointer to the CAN handle that triggered the event
 * @param[in]	- AppEvent: event code (CAN_EVENT_TX_MAILBOX_EMPTY, CAN_EVENT_RX_FIFO0_MSG, ...)
 *
 * @return		- none
 *
 * @Note		- Declared __weak so the linker uses the application's version when
 *                one is provided, without modifying this driver file.
 *
 * */
__weak void CAN_ApplicationEventCallback(CAN_Handle_t *pCANHandle, uint8_t AppEvent){
	//Weak implementation — override this function in your application
	(void)pCANHandle;
	(void)AppEvent;
}


/*
 * ============================================================
 * PRIVATE HELPER FUNCTIONS
 * ============================================================
 */

/***********************************************************************************
 * @fn			- can_get_free_tx_mailbox (private)
 *
 * @brief		- Checks the TME0/TME1/TME2 bits in TSR and returns the index of
 *                the first empty TX mailbox
 *
 * @param[in]	- pCANx: base address of the CAN peripheral
 *
 * @return		- CAN_TX_MAILBOX0, CAN_TX_MAILBOX1, CAN_TX_MAILBOX2, or CAN_TX_MAILBOX_NONE
 *
 * */
static uint8_t can_get_free_tx_mailbox(CAN_RegDef_t *pCANx){
	//TME0/TME1/TME2 at bits 26/27/28 in TSR indicate empty (ready) mailboxes
	if(pCANx->TSR & (1 << CAN_TSR_TME0))  return CAN_TX_MAILBOX0;
	if(pCANx->TSR & (1 << CAN_TSR_TME1))  return CAN_TX_MAILBOX1;
	if(pCANx->TSR & (1 << CAN_TSR_TME2))  return CAN_TX_MAILBOX2;
	return CAN_TX_MAILBOX_NONE;
}


/***********************************************************************************
 * @fn			- can_tx_mailbox_IThandle (private)
 *
 * @brief		- Processes the TX mailbox empty interrupt:
 *                  1. Clears RQCP flags for any completed mailboxes
 *                  2. Disables TMEIE once all mailboxes are free
 *                  3. Resets TxState and notifies the application
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 *
 * */
static void can_tx_mailbox_IThandle(CAN_Handle_t *pCANHandle){
	//Clear RQCP (Request Completed) for each mailbox that has finished
	//RQCP is a read/clear-by-write-1 flag
	if(pCANHandle->pCANx->TSR & (1 << CAN_TSR_RQCP0)){
		pCANHandle->pCANx->TSR |= (1 << CAN_TSR_RQCP0);
	}
	if(pCANHandle->pCANx->TSR & (1 << CAN_TSR_RQCP1)){
		pCANHandle->pCANx->TSR |= (1 << CAN_TSR_RQCP1);
	}
	if(pCANHandle->pCANx->TSR & (1 << CAN_TSR_RQCP2)){
		pCANHandle->pCANx->TSR |= (1 << CAN_TSR_RQCP2);
	}

	//If all three mailboxes are now empty, disable TMEIE to stop further TX interrupts
	if(pCANHandle->pCANx->TSR & ((1 << CAN_TSR_TME0) | (1 << CAN_TSR_TME1) | (1 << CAN_TSR_TME2))){
		pCANHandle->pCANx->IER &= ~(1 << CAN_IER_TMEIE);
		pCANHandle->TxState = CAN_READY;
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_TX_MAILBOX_EMPTY);
	}
}


/***********************************************************************************
 * @fn			- can_rx_fifo_IThandle (private)
 *
 * @brief		- Reads one pending message from the given FIFO into the buffer
 *                registered via CAN_ReceiveMessageIT(), releases the FIFO slot,
 *                disarms the interrupt, and fires the application callback
 *
 * @param[in]	- pCANHandle: pointer to CAN handle
 * @param[in]	- FIFONumber: CAN_FIFO0 or CAN_FIFO1
 *
 * */
static void can_rx_fifo_IThandle(CAN_Handle_t *pCANHandle, uint8_t FIFONumber){
	CAN_RxMsg_t *pRxMsg = pCANHandle->pRxMsg;

	//Read identifier
	if(!(pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR & (1 << CAN_RIR_IDE))){
		pRxMsg->IDE   = CAN_ID_STD;
		pRxMsg->StdId = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR >> CAN_RIR_STID) & 0x7FFU;
	}
	else{
		pRxMsg->IDE   = CAN_ID_EXT;
		pRxMsg->ExtId = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR >> CAN_RIR_EXID) & 0x1FFFFFFFU;
	}

	pRxMsg->RTR = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RIR  >> CAN_RIR_RTR)  & 0x1U;
	pRxMsg->DLC = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDTR)                  & 0xFU;
	pRxMsg->FMI = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDTR >> CAN_RDTR_FMI) & 0xFFU;

	pRxMsg->Data[0] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR)        & 0xFFU;
	pRxMsg->Data[1] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >>  8)  & 0xFFU;
	pRxMsg->Data[2] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >> 16)  & 0xFFU;
	pRxMsg->Data[3] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDLR >> 24)  & 0xFFU;
	pRxMsg->Data[4] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR)        & 0xFFU;
	pRxMsg->Data[5] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >>  8)  & 0xFFU;
	pRxMsg->Data[6] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >> 16)  & 0xFFU;
	pRxMsg->Data[7] = (pCANHandle->pCANx->sFIFOMailBox[FIFONumber].RDHR >> 24)  & 0xFFU;

	//Release FIFO mailbox slot — hardware can now use it for the next incoming frame
	if(FIFONumber == CAN_FIFO0)
		pCANHandle->pCANx->RF0R |= (1 << CAN_RF0R_RFOM0);
	else
		pCANHandle->pCANx->RF1R |= (1 << CAN_RF1R_RFOM1);

	//Disarm the interrupt and reset state — call CAN_ReceiveMessageIT() again to re-arm
	if(FIFONumber == CAN_FIFO0){
		pCANHandle->pCANx->IER &= ~(1 << CAN_IER_FMPIE0);
		pCANHandle->RxState = CAN_READY;
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_RX_FIFO0_MSG);
	}
	else{
		pCANHandle->pCANx->IER &= ~(1 << CAN_IER_FMPIE1);
		pCANHandle->RxState = CAN_READY;
		CAN_ApplicationEventCallback(pCANHandle, CAN_EVENT_RX_FIFO1_MSG);
	}
}
